In [1]:
# ## Agenda
# - 합, 누적합
# - 상관관계, 공분산
# - 중복값 처리

In [2]:
import pandas as pd
import numpy as np

In [3]:
## 1.3 기초 통계 함수

* `sum()`
* `mean()`
* `std()`
* `idxmax()`/`idxmin()`
* `cumsum()`
* `describe()`

- 기본적으로 열 단위로 작동하며
- 결측치는 행 또는 열의 모든 값이 결측치가 아니라면 기본적으로 무시되어 계산되지 않는다.
- 행 단위로 작동하게 하려면 축을 `axis=1` 또는 `axis='columns`로 지정
- 결측치를 무시하지 않으려면 `skipna=False`로 지정(무시하면 계산 결과가 나타나지 않는다.)

In [5]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])

In [7]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

* `sum()` 메서드: 행/열 단위 합 계산

In [8]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [10]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [11]:
df.sum(axis = 'columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [13]:
df.sum(skipna = False)
#결측치를 무시하지 않으면 계산되지 않는다

one   NaN
two   NaN
dtype: float64

In [14]:
#Series는 하나의 열을 갖는 데이터 프레임과 같은 방식으로 동작한다
df["one"].sum()

9.25

* `mean()` 메서드: 평균값 계산
전체를 더해서 전체 길이만큼 나눔

In [9]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [19]:
df.mean(axis = 1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [21]:
df.mean(axis = 'columns')

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [22]:
df.mean(skipna = False)

one   NaN
two   NaN
dtype: float64

In [23]:
df['two'].mean()

-2.9

- `std()` 메서드: 표준편차 계산
- var 분산 평귱으로부터의 거리 제곱의 평균
  - $${{{+2 [math( m= \frac{x_1 + x_2 + \cdot \cdot \cdot + x_N } {N} )]}}}$$

In [28]:
df.std()

one    3.493685
two    2.262742
dtype: float64

In [29]:
df.std(axis = 1)

a         NaN
b    8.202439
c         NaN
d    1.449569
dtype: float64

* `idxmax()`/`idxmin()`: 최댓값/최솟값을 갖는 인덱스 확인

In [30]:
df.idxmax()

one    b
two    d
dtype: object

In [31]:
df.idxmin()

one    d
two    b
dtype: object

* `cumsum()`: 누적 합 계산

In [32]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [33]:
df.cumsum(skipna =False)

   one  two
a  1.4  NaN
b  8.5  NaN
c  NaN  NaN
d  NaN  NaN

* `describe()`: 요약 통계 보여주기

In [34]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

수치형 데이터의 경우 평균값, 표준편차, 사분위수 등의 통계 정보를 요약해서 보여준다.

수치형 데이터가 아닐 경우 다른 요약 통계를 보여준다.

In [15]:
ser = pd.Series(['a', 'a', 'b', 'c'] * 2)

In [36]:
ser.describe()  #몇개가 나오는지 유니크한게 몇개인지

count     8
unique    3
top       a
freq      4
dtype: object

In [16]:
### 1.3.1 상관관계와 공분산

4 개 회사의 주가(price)와 거래량(volume)을 담고 있는 두 개의 데이터를 이용하여 상관계수와 공분산을 계산해보자.

- pkl 파일: 판다스에서 제공하는 객체를 `to_pickle()` 메서드를 이용하여 
    컴퓨터에 파일로 저장할 때 사용되는 바이너리 파일.
- `read_pickle()`: 저장된 pkl 파일을 파이썬으로 불러오는 함수

아래 코드는 일별 주가 데이터를 불러온다.
2010년 1월 4일부터 2016년 10월 21일까지의 데이터 1714개를 담고 있다.

In [38]:
price = pd.read_pickle('./5_yahoo_price.pkl')
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

아래 코드는 동일 회사, 동일 날짜의 1일 거래량(volume) 담고 있는 데이터를 불러온다.

In [40]:
volume = pd.read_pickle('./5_yahoo_volume.pkl')
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

주가의 일단위 변화율을 알아보기 위해 퍼센트 변화율을 확인해보자.

__참고:__ 증권분야에서 return은 이익율을 의미한다.

In [41]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [18]:
####  `corr()`/`cov()` 메서드

상관계수와 공분산 모두 두 확률변수 사이의 선형관계를 보여주며
차이점은 다음과 같다.

- 공분산: 두 확률변수 $X, Y$ 사이의 선형관계
    - 양수/음수 여부에 따라 양 또는 음의 선형관계
    - 절댓값이 클 수록 강한 선형관계를 갖고있다. 
    - 다만, 사용되는 확률변수의 척도(scale)에 많은 영향을 많이받아 정규화된 값인 상관계수를 주로 사용한다. 

$$
\begin{align*}
Cov(X, Y) & = E((X-\mu_X)(Y-\mu_Y))\\[2ex]
\mu_X & = E(X) = \dfrac{\sum X}{n}\\[1.5ex]
\mu_Y & = E(Y) = \dfrac{\sum Y}{n}
\end{align*}
$$

- 상관계수: 두 확률변수 사이의 선형관계를 -1과 1 사이의 값으로 표현.
    - 양수/음수 여부에 따라 양 또는 음의 선형관계
    - 절댓값이 1에 가까울 수록 강한 선형관계
$$
\begin{align*}
\rho & = \frac{Cov(X, Y)}{\sigma_X\cdot \sigma_Y}\\[2ex]
\sigma_X & = \sqrt{Var(X)}\\[1.5ex]
\sigma_X & = \sqrt{Var(X)}\\[1.5ex]
Var(X) & = \dfrac{\sum (X-\mu_X)^2}{n}\\[1.5ex]
Var(Y) & = \dfrac{\sum (X-\mu_Y)^2}{n}
\end{align*}
$$

'MSFT'와 'IBM' 사이의 상관계수

In [42]:
returns["MSFT"].corr(returns["IBM"])

0.49976361144151155

'MSFT'와 'IBM' 사이의 공분산

In [43]:
returns["MSFT"].cov(returns["IBM"])

8.870655479703546e-05

In [44]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [45]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

모든 회사들 간의 상관계수와 공분산

#### `corrwith()`  
- 다른 시리즈 또는 데이터프레임과의 상관계수 계산
- 시리즈를 인자로 사용하면 각 열에 대한 상관계수를 계산

In [47]:
#a IBMrhk return DF과의 상관계수를 계산한다
returns.corrwith(returns.IBM)

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [49]:
#같은 인덱스를 갖고 있을때
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

- 데이터프레임에 대해서는 공통 인덱스를 사용하는 모든 열에 대한 상관계수를 계산

In [24]:
### 1.3.2 중복과 빈도수

In [25]:
#### `unique()`

- Series에서 사용된 값을 중복 없이 확인하려면 `unique()` 메서드 사용 
- `set()` 함수와 유사하게 동작, 넘파이 어레이를 반환

In [26]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [50]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

#### `value_counts()`
- 값들의 빈도수를 확인하기 위해 사용

In [51]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

### Introduction:

GroupBy can be summarized as Split-Apply-Combine.

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

Check out this [Diagram](http://i.imgur.com/yjNkiwL.png)  
### Step 1. 필요한 라이브러리 들을 import 하세요

In [59]:
import numpy as np
import pandas as pd

In [61]:
### Step 2. 다음 주소로 부터 dataset을 import 하세요 [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv). 
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv'
drinks = pd.read_csv(url, sep = ',')

In [63]:
### Step 3. drinks 변수에 DataFrame을 할당 하세요
drinks = pd.DataFrame(drinks)

In [74]:
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [67]:
print(drinks.info())
print(drinks.shape)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB
None
(193, 6)

In [72]:
### Step 4. 각 continent별 beer_servings의 평균은 얼마인가요?
drinks.groupby(by = 'continent').beer_servings.mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

In [73]:
### Step 5. 각 continent별 wine_servings의 통계량을 출력하세요
drinks.groupby(by = 'continent').wine_servings.describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

In [76]:
### Step 6. 모든 column에 대해 continent별 각 음료간의 소비량의 평균을 구하세요
drinks.groupby(by = 'continent').mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

In [77]:
### Step 7. 모든 column에 대해 continent별 각 음료간의 소비량의 중간값을 구하세요
drinks.groupby(by = 'continent').median()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

In [87]:
### Step 8. spirit 소비량에 대한 평균, 최소, 최대 값을 구하세요
drinks.groupby(by = 'continent').spirit_servings.agg(['mean','max','min'])

                 mean  max  min
continent
AF          16.339623  152    0
AS          60.840909  326    0
EU         132.555556  373    0
OC          58.437500  254    0
SA         114.750000  302   25

In [108]:
# Occupation

In [109]:
### Introduction:

# Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. 필요한 라이브러리 들을 import 하세요

In [185]:
### Step 2. 다음 주소로 부터 dataset을 import 하세요 [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user). 
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep ='|')

In [186]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [187]:
### Step 3. users 변수에 DataFrame을 할당 하세요.
#### index 는 user_id입니다.
users = pd.DataFrame(users).set_index('user_id')

In [188]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [189]:
### Step 4.  occupation별 평균 나이는 얼마입니까?
users.groupby('occupation').mean()

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060
entertainment  29.222222
executive      38.718750
healthcare     41.562500
homemaker      32.571429
lawyer         36.750000
librarian      40.000000
marketing      37.615385
none           26.555556
other          34.523810
programmer     33.121212
retired        63.071429
salesman       35.666667
scientist      35.548387
student        22.081633
technician     33.148148
writer         36.311111

In [196]:
# ### Step 5. occupation별 남성의 비율을 확인하고 내림차순으로 정렬하세요
# users['gender'][users['gender'] == 'M'] =0
# users['gender'][users['gender'] == 'F'] =1

# users.loc[users['gender']=='F','gender'] = 1
# users.loc[users['gender']=='M','gender'] = 0
# users.gender = users.gender.astype(int)

# f_user =users.groupby('occupation').mean().gender
# man_ratio = 1-f_user.sort_values()
# man_ratio

In [191]:
def gender2num(x):
    if x == 'M':
        return 1 
    if x == 'F':
        return 0 
users["gender2num"] = users['gender'].apply(gender2num)

In [192]:
users

         age gender     occupation zip_code  gender2num
user_id
1         24      M     technician    85711           1
2         53      F          other    94043           0
3         23      M         writer    32067           1
4         24      M     technician    43537           1
5         33      F          other    15213           0
...      ...    ...            ...      ...         ...
939       26      F        student    33319           0
940       32      M  administrator    02215           1
941       20      M        student    97229           1
942       48      F      librarian    78209           0
943       22      M        student    77841           1

[943 rows x 5 columns]

In [195]:
users.groupby('occupation').gender2num.sum() / users.occupation.value_counts()

administrator    0.544304
artist           0.535714
doctor           1.000000
educator         0.726316
engineer         0.970149
entertainment    0.888889
executive        0.906250
healthcare       0.312500
homemaker        0.142857
lawyer           0.833333
librarian        0.431373
marketing        0.615385
none             0.555556
other            0.657143
programmer       0.909091
retired          0.928571
salesman         0.750000
scientist        0.903226
student          0.693878
technician       0.962963
writer           0.577778
dtype: float64

In [157]:
### Step 6. 각 occupation별 최대 최소 age를 확인하세요
users.groupby('occupation').age.agg(['max','min'])

               max  min
occupation
administrator   70   21
artist          48   19
doctor          64   28
educator        63   23
engineer        70   22
entertainment   50   15
executive       69   22
healthcare      62   22
homemaker       50   20
lawyer          53   21
librarian       69   23
marketing       55   24
none            55   11
other           64   13
programmer      63   20
retired         73   51
salesman        66   18
scientist       55   23
student         42    7
technician      55   21
writer          60   18

In [198]:
### Step 7. occupation에 따른 gender별 평균 age를 계산 하세요
users.groupby(['occupation','gender']).age.mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

In [203]:
### Step 8. 각 occupation별 남성과 여성의 비율을 나타내시오
#### 어려움
gender_oc = users.groupby(['occupation','gender']).agg({'gender':'count'})

In [204]:
# users.groupby(['occupation','gender']).count()

In [200]:
gender_oc

                      gender
occupation    gender
administrator F           36
              M           43
artist        F           13
              M           15
doctor        M            7
educator      F           26
              M           69
engineer      F            2
              M           65
entertainment F            2
              M           16
executive     F            3
              M           29
healthcare    F           11
              M            5
homemaker     F            6
              M            1
lawyer        F            2
              M           10
librarian     F           29
              M           22
marketing     F           10
              M           16
none          F            4
              M            5
other         F           36
              M           69
programmer    F            6
              M           60
retired       F            1
              M           13
salesman      F            3
              M            9
scientist     F            3
              M           28
student       F           60
              M          136
technician    F            1
              M           26
writer        F           19
              M           26

In [210]:
oc_count = users.groupby(['occupation']).count()
oc_count
#성별이 안나눠져있다

               age  gender  zip_code  gender2num
occupation
administrator   79      79        79          79
artist          28      28        28          28
doctor           7       7         7           7
educator        95      95        95          95
engineer        67      67        67          67
entertainment   18      18        18          18
executive       32      32        32          32
healthcare      16      16        16          16
homemaker        7       7         7           7
lawyer          12      12        12          12
librarian       51      51        51          51
marketing       26      26        26          26
none             9       9         9           9
other          105     105       105         105
programmer      66      66        66          66
retired         14      14        14          14
salesman        12      12        12          12
scientist       31      31        31          31
student        196     196       196         196
technician      27      27        27          27
writer          45      45        45          45

In [211]:
gender_oc.div(oc_count, level = 'occupation')  #나누는 방법 occupation별로 gender를 나누다
#level로 정해줄수있다

                      age    gender  gender2num  zip_code
occupation    gender
administrator F       NaN  0.455696         NaN       NaN
              M       NaN  0.544304         NaN       NaN
artist        F       NaN  0.464286         NaN       NaN
              M       NaN  0.535714         NaN       NaN
doctor        M       NaN  1.000000         NaN       NaN
educator      F       NaN  0.273684         NaN       NaN
              M       NaN  0.726316         NaN       NaN
engineer      F       NaN  0.029851         NaN       NaN
              M       NaN  0.970149         NaN       NaN
entertainment F       NaN  0.111111         NaN       NaN
              M       NaN  0.888889         NaN       NaN
executive     F       NaN  0.093750         NaN       NaN
              M       NaN  0.906250         NaN       NaN
healthcare    F       NaN  0.687500         NaN       NaN
              M       NaN  0.312500         NaN       NaN
homemaker     F       NaN  0.857143         NaN       NaN
              M       NaN  0.142857         NaN       NaN
lawyer        F       NaN  0.166667         NaN       NaN
              M       NaN  0.833333         NaN       NaN
librarian     F       NaN  0.568627         NaN       NaN
              M       NaN  0.431373         NaN       NaN
marketing     F       NaN  0.384615         NaN       NaN
              M       NaN  0.615385         NaN       NaN
none          F       NaN  0.444444         NaN       NaN
              M       NaN  0.555556         NaN       NaN
other         F       NaN  0.342857         NaN       NaN
              M       NaN  0.657143         NaN       NaN
programmer    F       NaN  0.090909         NaN       NaN
              M       NaN  0.909091         NaN       NaN
retired       F       NaN  0.071429         NaN       NaN
              M       NaN  0.928571         NaN       NaN
salesman      F       NaN  0.250000         NaN       NaN
              M       NaN  0.750000         NaN       NaN
scientist     F       NaN  0.096774         NaN       NaN
              M       NaN  0.903226         NaN       NaN
student       F       NaN  0.306122         NaN       NaN
              M       NaN  0.693878         NaN       NaN
technician    F       NaN  0.037037         NaN       NaN
              M       NaN  0.962963         NaN       NaN
writer        F       NaN  0.422222         NaN       NaN
              M       NaN  0.577778         NaN       NaN

In [215]:
users.groupby('occupation').gender.value_counts(normalize = True)

occupation     gender
administrator  M         0.544304
               F         0.455696
artist         M         0.535714
               F         0.464286
doctor         M         1.000000
educator       M         0.726316
               F         0.273684
engineer       M         0.970149
               F         0.029851
entertainment  M         0.888889
               F         0.111111
executive      M         0.906250
               F         0.093750
healthcare     F         0.687500
               M         0.312500
homemaker      F         0.857143
               M         0.142857
lawyer         M         0.833333
               F         0.166667
librarian      F         0.568627
               M         0.431373
marketing      M         0.615385
               F         0.384615
none           M         0.555556
               F         0.444444
other          M         0.657143
               F         0.342857
programmer     M         0.909091
               F         0.090909
retired        M         0.928571
               F         0.071429
salesman       M         0.750000
               F         0.250000
scientist      M         0.903226
               F         0.096774
student        M         0.693878
               F         0.306122
technician     M         0.962963
               F         0.037037
writer         M         0.577778
               F         0.422222
Name: gender, dtype: float64

## Agenda
- TimeSeries Data
- 시간의 흐름에 따라 변화 하는 data

-주가 날씨 등

In [216]:
import pandas as pd
import numpy as np

np.random.seed(252)

In [217]:
## Time Series

- "timeseries" 데이터는 `DatetimeIndex` 또는 `PeriodIndex`로 구성된 데이터 셋이다

### to_datetime
datetime으로 data의 type을 변경해주는 함수

In [239]:
date = '20220720'
type(date)

str

In [240]:
pd.to_datetime(date)

Timestamp('2022-07-20 00:00:00')

In [241]:
date = "2022-07-20"
pd.to_datetime(date)

Timestamp('2022-07-20 00:00:00')

format을 이용

In [242]:
date = '20220720'
type(date)
pd.to_datetime(date, format = '%Y%m%d')

Timestamp('2022-07-20 00:00:00')

In [244]:
data = '2022년07월20일'
pd.to_datetime(data, format = '%Y년%m월%d일')

Timestamp('2022-07-20 00:00:00')

In [245]:
time_data = pd.to_datetime(data, format = '%Y년%m월%d일')
type(time_data)

pandas._libs.tslibs.timestamps.Timestamp

In [246]:
time_data.day

20

In [247]:
time_data.year

2022

### sample data 생성

In [220]:
def random_series(dts):
    res = pd.Series(np.random.randn(len(dts)), index=dts)
    return res

`Timestamp` 를 이용해 시간 객체 생성

In [249]:
ts = pd.Timestamp("2022-07-20 13:18")

In [250]:
ts

Timestamp('2022-07-20 13:18:00')

In [252]:
s_1 = pd.Series(111.2, index = [ts])

In [254]:
s_1

2022-07-20 13:18:00    111.2
dtype: float64

In [253]:
s_1.index

DatetimeIndex(['2022-07-20 13:18:00'], dtype='datetime64[ns]', freq=None)

## Time Series의 함수들
- `date_range` : 시작일과 종료일 또는 시작일과 기간을 입력하면 범위 내의 인덱스 생성
```
s: 초
T: 분
H: 시간
D: 일(day)
B: 주말이 아닌 평일
W: 주(일요일)
W-MON: 주(월요일)
M: 각 달(month)의 마지막 날
MS: 각 달의 첫날
BM: 주말이 아닌 평일 중에서 각 달의 마지막 날
BMS: 주말이 아닌 평일 중에서 각 달의 첫날
WOM-2THU: 각 달의 두번째 목요일
Q-JAN: 각 분기의 첫달의 마지막 날
Q-DEC: 각 분기의 마지막 달의 마지막 날
```

In [258]:
dts = pd.date_range('2022-01-01','2023-12-31', freq = 'B')  #주 5일 기준으로 생성

In [261]:
dts

DatetimeIndex(['2022-01-03', '2022-01-04', '2022-01-05', '2022-01-06',
               '2022-01-07', '2022-01-10', '2022-01-11', '2022-01-12',
               '2022-01-13', '2022-01-14',
               ...
               '2023-12-18', '2023-12-19', '2023-12-20', '2023-12-21',
               '2023-12-22', '2023-12-25', '2023-12-26', '2023-12-27',
               '2023-12-28', '2023-12-29'],
              dtype='datetime64[ns]', length=520, freq='B')

In [260]:
pd.date_range('2022-01-01','2023-12-31', freq = '6D') #6일 간격으로 생성

DatetimeIndex(['2022-01-01', '2022-01-07', '2022-01-13', '2022-01-19',
               '2022-01-25', '2022-01-31', '2022-02-06', '2022-02-12',
               '2022-02-18', '2022-02-24',
               ...
               '2023-11-04', '2023-11-10', '2023-11-16', '2023-11-22',
               '2023-11-28', '2023-12-04', '2023-12-10', '2023-12-16',
               '2023-12-22', '2023-12-28'],
              dtype='datetime64[ns]', length=122, freq='6D')

In [262]:
ts = pd.Series(np.random.randn(len(dts)), index = dts)

In [264]:
ts.head()

2022-01-03   -0.011498
2022-01-04   -0.085123
2022-01-05    0.075910
2022-01-06   -1.649279
2022-01-07   -0.751812
Freq: B, dtype: float64

## 시계열 데이터에서의 indexing 과 slicing

- indexing

In [265]:
ts["2023-03-15"]

0.5063759061902118

In [266]:
ts["2023-11-14"]

-1.2240878839187168

In [269]:
ts["2023-11-18"]  #11월 18일은 휴일

KeyError: '2023-11-18'

- slicing

In [271]:
ts["2023-11-18":"2023-11-25"] #휴일이 있어도 slicing은 가능하다

2023-11-20    1.126263
2023-11-21   -0.151621
2023-11-22    0.735057
2023-11-23   -0.915439
2023-11-24   -0.824778
Freq: B, dtype: float64

- 달별 선택

In [273]:
ts["2023-11"].head()

2023-11-01   -0.842949
2023-11-02   -1.405563
2023-11-03   -0.820971
2023-11-06   -1.767894
2023-11-07   -0.296673
Freq: B, dtype: float64

- 연도별 선택

In [275]:
ts["2023"].head()

2023-01-02    1.356573
2023-01-03    0.708200
2023-01-04   -0.382089
2023-01-05   -1.095396
2023-01-06    2.584973
Freq: B, dtype: float64

## 시계열 데이터의 이동 
- `shift()` 를 이용해 이동할 수 있다. 
- [참고](https://towardsdatascience.com/all-the-pandas-shift-you-should-know-for-data-analysis-791c1692b5e)

### Lagging(후행)

In [276]:
ts["2022-01"].iloc[[0,1,2,3,4,-2,-1]]

2022-01-03   -0.011498
2022-01-04   -0.085123
2022-01-05    0.075910
2022-01-06   -1.649279
2022-01-07   -0.751812
2022-01-28   -0.858197
2022-01-31    1.681411
dtype: float64

In [277]:
ts22 = ts["2022-01"].copy()
ts22.shift(1).iloc[[0,1,2,3,4,-2,-1]]

2022-01-03         NaN
2022-01-04   -0.011498
2022-01-05   -0.085123
2022-01-06    0.075910
2022-01-07   -1.649279
2022-01-28   -1.724383
2022-01-31   -0.858197
dtype: float64

### Leading(선행)

In [278]:
ts22 = ts["2022-01"].copy()
ts22.shift(-1).iloc[[0,1,2,3,4,-2,-1]]

2022-01-03   -0.085123
2022-01-04    0.075910
2022-01-05   -1.649279
2022-01-06   -0.751812
2022-01-07    1.247329
2022-01-28    1.681411
2022-01-31         NaN
dtype: float64

## 간격 재조정
- `resample` : 시간 간격을 재조정하는 resampling 가능

In [283]:
dts_1 = pd.date_range("2022-01-01","2022-03-31", freq = 'D')
tsd_2 = pd.Series(np.random.randn(len(dts_1)), index = dts_1)

In [284]:
tsd_2

2022-01-01    0.736192
2022-01-02   -0.278238
2022-01-03    1.543682
2022-01-04    1.301518
2022-01-05   -0.800265
                ...
2022-03-27   -0.636845
2022-03-28   -2.094463
2022-03-29   -0.621188
2022-03-30    0.262557
2022-03-31    0.808176
Freq: D, Length: 90, dtype: float64

In [288]:
grp = tsd_2.resample("M")

In [289]:
grp

In [290]:
grp.mean()

2022-01-31   -0.356407
2022-02-28   -0.301366
2022-03-31   -0.086568
Freq: M, dtype: float64

In [292]:
grp.agg(["mean","std"])

                mean       std
2022-01-31 -0.356407  1.065358
2022-02-28 -0.301366  1.002060
2022-03-31 -0.086568  0.905995

In [295]:
grp = tsd_2.resample("2M")

In [296]:
grp.mean()

2022-01-31   -0.356407
2022-03-31   -0.188506
Freq: 2M, dtype: float64

In [281]:
dts_1

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12',
               '2022-01-13', '2022-01-14', '2022-01-15', '2022-01-16',
               '2022-01-17', '2022-01-18', '2022-01-19', '2022-01-20',
               '2022-01-21', '2022-01-22', '2022-01-23', '2022-01-24',
               '2022-01-25', '2022-01-26', '2022-01-27', '2022-01-28',
               '2022-01-29', '2022-01-30', '2022-01-31', '2022-02-01',
               '2022-02-02', '2022-02-03', '2022-02-04', '2022-02-05',
               '2022-02-06', '2022-02-07', '2022-02-08', '2022-02-09',
               '2022-02-10', '2022-02-11', '2022-02-12', '2022-02-13',
               '2022-02-14', '2022-02-15', '2022-02-16', '2022-02-17',
               '2022-02-18', '2022-02-19', '2022-02-20', '2022-02-21',
               '2022-02-22', '2022-02-23', '2022-02-24', '2022-02-25',
               '2022-02-26', '2022-02-27', '2022-02-28', '2022-03-01',
               '2022-03-02', '2022-03-03', '2022-03-04', '2022-03-05',
               '2022-03-06', '2022-03-07', '2022-03-08', '2022-03-09',
               '2022-03-10', '2022-03-11', '2022-03-12', '2022-03-13',
               '2022-03-14', '2022-03-15', '2022-03-16', '2022-03-17',
               '2022-03-18', '2022-03-19', '2022-03-20', '2022-03-21',
               '2022-03-22', '2022-03-23', '2022-03-24', '2022-03-25',
               '2022-03-26', '2022-03-27', '2022-03-28', '2022-03-29',
               '2022-03-30', '2022-03-31'],
              dtype='datetime64[ns]', freq='D')

- Resampling은 groupby와 비슷하게 동작한다.

## dt접근자
- datetime 자료형 시리즈에는 dt 접근자존재
- datetime 자료형이 가진 몇가지 유용한 속성과 메서드를 사용할

In [298]:
pd.Series(ts.index).dt.strftime(date_format = "%Y년, %m월, %d일")

0      2022년, 01월, 03일
1      2022년, 01월, 04일
2      2022년, 01월, 05일
3      2022년, 01월, 06일
4      2022년, 01월, 07일
            ...
515    2023년, 12월, 25일
516    2023년, 12월, 26일
517    2023년, 12월, 27일
518    2023년, 12월, 28일
519    2023년, 12월, 29일
Length: 520, dtype: object

### Introduction:

Special thanks to: http://chrisalbon.com/ for sharing the dataset and materials.

### Step 1. 필요한 라이브러리 들을 import 하세요

### Step 2. 다음 raw_data 를 이용하여 DataFrame을 만드세요

In [300]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Step 3. regiment 라는 변수에 DataFrame을 할당 하세요.
#### 각 column값을 raw_data의 key값으로 설정하세요

In [347]:
regiment= pd.DataFrame(raw_data, columns = raw_data.keys())

In [349]:
regiment

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

### Step 4. Nighthawks regiment의 평균 preTestScore는 얼마입니까?

In [350]:
regiment.groupby("regiment")["preTestScore"].mean()["Nighthawks"]

15.25

### Step 5. company의 종합 통계량을 제시하세요

In [351]:
regiment.groupby("company").describe()

        preTestScore                                                      \
               count       mean        std  min   25%   50%    75%   max
company
1st              6.0   6.666667   8.524475  2.0  3.00   3.5   4.00  24.0
2nd              6.0  15.500000  14.652645  2.0  2.25  13.5  29.25  31.0

        postTestScore
                count       mean        std   min    25%   50%   75%   max
company
1st               6.0  57.666667  27.485754  25.0  34.25  66.0  70.0  94.0
2nd               6.0  67.000000  14.057027  57.0  58.25  62.0  68.0  94.0

### Step 6. 각 company의 평균 preTestScore는 얼마입니까?

In [358]:
regiment.groupby("company").describe().loc[:,('preTestScore','mean')]  #튜플로 정해준다
#loc 는 행부터

company
1st     6.666667
2nd    15.500000
Name: (preTestScore, mean), dtype: float64

In [311]:
regiment.groupby("company")["preTestScore"].mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

### Step 7. regiment 별 company의 평균 preTestScores 제시하세요

In [318]:
regiment.groupby(["regiment","company"])["preTestScore"].mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

### Step 8. regiment 별 company의 평균 preTestScores를 heirarchical indexing 없이 제시하시오.
#### Hint : unstack()

In [359]:
re_1 = regiment.groupby(["regiment","company"])["preTestScore"].mean()
re_1.unstack()

#리인덱싱하는법

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

### Step 9. regiment 별 company에 대해 다음과 같은 통계량을 제시하시오.
#### preTestScore, postTestScore의 평균

In [362]:
regiment.groupby(["regiment","company"]).mean()

                    preTestScore  postTestScore
regiment   company
Dragoons   1st               3.5           47.5
           2nd              27.5           75.5
Nighthawks 1st              14.0           59.5
           2nd              16.5           59.5
Scouts     1st               2.5           66.0
           2nd               2.5           66.0

In [365]:
regiment.groupby(["regiment","company"]).mean().preTestScore.unstack()

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

# United States - Crime Rates - 1960 - 2014

### Introduction:

This time you will create a data 

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. 필요한 librarie를 import 하세요

### Step 2. 다음 주소로부터 Data를 import 하세요 [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/US_Crime_Rates/US_Crime_Rates_1960_2014.csv).

In [442]:
crime = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/US_Crime_Rates/US_Crime_Rates_1960_2014.csv", sep = ',')

### Step 3. crime 변수에 DataFrame을 할당 하세요

In [443]:
crime = pd.DataFrame(crime)
crime.head()

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
0,1960,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1,1961,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
2,1962,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
3,1963,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
4,1964,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800

In [444]:
crime.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Year                55 non-null     int64
 1   Population          55 non-null     int64
 2   Total               55 non-null     int64
 3   Violent             55 non-null     int64
 4   Property            55 non-null     int64
 5   Murder              55 non-null     int64
 6   Forcible_Rape       55 non-null     int64
 7   Robbery             55 non-null     int64
 8   Aggravated_assault  55 non-null     int64
 9   Burglary            55 non-null     int64
 10  Larceny_Theft       55 non-null     int64
 11  Vehicle_Theft       55 non-null     int64
dtypes: int64(12)
memory usage: 5.3 KB

### Step 4. column의 data type은 무엇입니까?

In [445]:
crime.dtypes

Year                  int64
Population            int64
Total                 int64
Violent               int64
Property              int64
Murder                int64
Forcible_Rape         int64
Robbery               int64
Aggravated_assault    int64
Burglary              int64
Larceny_Theft         int64
Vehicle_Theft         int64
dtype: object

##### Year의Data Type은 int64 입니다. pandas 는 datetime 유형을 지원합니다. 

### Step 5. column Year의 dtype을 datetime64로 변경하세요
#### 참고 : to_datetime 을 사용

In [446]:
crime.Year = pd.to_datetime(crime["Year"], format = '%Y')

In [447]:
crime.dtypes

Year                  datetime64[ns]
Population                     int64
Total                          int64
Violent                        int64
Property                       int64
Murder                         int64
Forcible_Rape                  int64
Robbery                        int64
Aggravated_assault             int64
Burglary                       int64
Larceny_Theft                  int64
Vehicle_Theft                  int64
dtype: object

In [448]:
crime.head()

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
0,1960-01-01,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1,1961-01-01,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
2,1962-01-01,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
3,1963-01-01,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
4,1964-01-01,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800

### Step 6. Year column을 dataframe의 index로 설정하세요. 기존의 index는 삭제합니다.

In [449]:
# users = pd.DataFrame(users).set_index('user_id')
crime.set_index('Year', inplace = True)

In [450]:
crime.head()

,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
Year,,,,,,,,,,,
1960-01-01,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1961-01-01,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
1962-01-01,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
1963-01-01,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
1964-01-01,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800

### Step 7. Total column을 삭제 합니다.

In [451]:
del crime["Total"]

In [452]:
crime.head()

,Population,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
Year,,,,,,,,,,
1960-01-01,179323175,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1961-01-01,182992000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
1962-01-01,185771000,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
1963-01-01,188483000,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
1964-01-01,191141000,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800

### Step 8. year를 10년 단위로 그룹화하고 값의 합계를 구하세요

#### Population column number에 주의하여 DataFrame을 구하세요

- resample을 확인해 보세요[resample](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.resample.html) [참고](https://wikidocs.net/158101)
- Aliases를 확인해 보세요[Aliases](http://pandas.pydata.org/pandas-docs/stable/timeseries.html#offset-aliases)

In [462]:
crime.resample("10AS").sum().head()  #10년단위로

,Population,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
Year,,,,,,,,,,
1960-01-01,1915053175,4134930,45160900,106180,236720,1633510,2158520,13321100,26547700,5292100
1970-01-01,2121193298,9607930,91383800,192230,554570,4159020,4702120,28486000,53157800,9739900
1980-01-01,2371370069,14074328,117048900,206439,865639,5383109,7619130,33073494,72040253,11935411
1990-01-01,2612825258,17527048,119053499,211664,998827,5748930,10568963,26750015,77679366,14624418
2000-01-01,2947969117,13968056,100944369,163068,922499,4230366,8652124,21565176,67970291,11412834

In [461]:
crime.resample("10A").sum().head()  #10년단위로

,Population,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
Year,,,,,,,,,,
1960-12-31,179323175,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1970-12-31,1938965298,4585290,49424400,113070,257520,1875530,2339170,14614000,28918100,5892300
1980-12-31,2143307264,10213630,96088300,199270,599570,4375000,5039800,30076200,56068900,9943200
1990-12-31,2394730678,14549938,117640700,206839,885209,5456539,8001340,32352194,72849053,12439611
2000-12-31,2645537291,17132404,116580585,203810,986445,5517676,10425809,25727107,76705256,14148520

### Step 9. 미국에서 살기 가장 위험한(살인이 많이 일어난) 10년은 언제 인가요?

In [465]:
crime.resample("10AS").sum().idxmax()  #가장 많은 index를 보여준다

Population           2000-01-01
Violent              1990-01-01
Property             1990-01-01
Murder               1990-01-01
Forcible_Rape        1990-01-01
Robbery              1990-01-01
Aggravated_assault   1990-01-01
Burglary             1980-01-01
Larceny_Theft        1990-01-01
Vehicle_Theft        1990-01-01
dtype: datetime64[ns]

In [466]:
crime = crime.resample("10AS").sum()
crime["Population"] = crime["Population"].resample("10AS").max()

In [467]:
crime.resample("10AS").sum().idxmax()

Population           2000-01-01
Violent              1990-01-01
Property             1990-01-01
Murder               1990-01-01
Forcible_Rape        1990-01-01
Robbery              1990-01-01
Aggravated_assault   1990-01-01
Burglary             1980-01-01
Larceny_Theft        1990-01-01
Vehicle_Theft        1990-01-01
dtype: datetime64[ns]

In [468]:
crime

,Population,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
Year,,,,,,,,,,
1960-01-01,1915053175,4134930,45160900,106180,236720,1633510,2158520,13321100,26547700,5292100
1970-01-01,2121193298,9607930,91383800,192230,554570,4159020,4702120,28486000,53157800,9739900
1980-01-01,2371370069,14074328,117048900,206439,865639,5383109,7619130,33073494,72040253,11935411
1990-01-01,2612825258,17527048,119053499,211664,998827,5748930,10568963,26750015,77679366,14624418
2000-01-01,2947969117,13968056,100944369,163068,922499,4230366,8652124,21565176,67970291,11412834
2010-01-01,1570146307,6072017,44095950,72867,421059,1749809,3764142,10125170,30401698,3569080

# Investor - Flow of Funds - US

### Introduction:

Special thanks to: https://github.com/rgrp for sharing the dataset.

### Step 1. 필요한 librarie들을 import 하세요

### Step 2. 다음과 같은 DataSet을 import 하세요 [address](https://raw.githubusercontent.com/datasets/investor-flow-of-funds-us/master/data/weekly.csv).

In [536]:
df = pd.read_csv('https://raw.githubusercontent.com/datasets/investor-flow-of-funds-us/master/data/weekly.csv', sep = ',')

### Step 3. df 라는 변수에 DataFrame을 할당하세요

In [537]:
df = pd.DataFrame(df)

In [538]:
df.head()

,Date,Total Equity,Domestic Equity,World Equity,Hybrid,Total Bond,Taxable Bond,Municipal Bond,Total
0,2012-12-05,-7426,-6060,-1367,-74,5317,4210,1107,-2183
1,2012-12-12,-8783,-7520,-1263,123,1818,1598,219,-6842
2,2012-12-19,-5496,-5470,-26,-73,103,3472,-3369,-5466
3,2012-12-26,-4451,-4076,-375,550,2610,3333,-722,-1291
4,2013-01-02,-11156,-9622,-1533,-158,2383,2103,280,-8931

In [539]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date             44 non-null     object
 1   Total Equity     44 non-null     int64
 2   Domestic Equity  44 non-null     int64
 3   World Equity     44 non-null     int64
 4   Hybrid           44 non-null     int64
 5   Total Bond       44 non-null     int64
 6   Taxable Bond     44 non-null     int64
 7   Municipal Bond   44 non-null     int64
 8   Total            44 non-null     int64
dtypes: int64(8), object(1)
memory usage: 3.2+ KB

### Step 5. Date column을 index로 할당하세요

In [540]:
df.set_index('Date',  inplace = True)

In [541]:
df.head()

,Total Equity,Domestic Equity,World Equity,Hybrid,Total Bond,Taxable Bond,Municipal Bond,Total
Date,,,,,,,,
2012-12-05,-7426,-6060,-1367,-74,5317,4210,1107,-2183
2012-12-12,-8783,-7520,-1263,123,1818,1598,219,-6842
2012-12-19,-5496,-5470,-26,-73,103,3472,-3369,-5466
2012-12-26,-4451,-4076,-375,550,2610,3333,-722,-1291
2013-01-02,-11156,-9622,-1533,-158,2383,2103,280,-8931

### Step 6. index의 data type은 무엇인가요?

In [542]:
df.index

Index(['2012-12-05', '2012-12-12', '2012-12-19', '2012-12-26', '2013-01-02',
       '2013-01-09', '2014-04-02', '2014-04-09', '2014-04-16', '2014-04-23',
       '2014-04-30', '2014-05-07', '2014-05-14', '2014-05-21', '2014-05-28',
       '2014-06-04', '2014-06-11', '2014-06-18', '2014-06-25', '2014-07-02',
       '2014-07-09', '2014-07-30', '2014-08-06', '2014-08-13', '2014-08-20',
       '2014-08-27', '2014-09-03', '2014-09-10', '2014-11-05', '2014-11-12',
       '2014-11-19', '2014-11-25', '2015-01-07', '2015-01-14', '2015-01-21',
       '2015-01-28', '2015-02-04', '2015-02-11', '2015-03-04', '2015-03-11',
       '2015-03-18', '2015-03-25', '2015-04-01', '2015-04-08'],
      dtype='object', name='Date')

### Step 7. index를 DatetimeIndex type으로 변경하세요

In [543]:
# df.index = pd.to_datetime(df.index, format = '%Y-%m-%d')
df.index = pd.to_datetime(df.index)

In [544]:
df.index

DatetimeIndex(['2012-12-05', '2012-12-12', '2012-12-19', '2012-12-26',
               '2013-01-02', '2013-01-09', '2014-04-02', '2014-04-09',
               '2014-04-16', '2014-04-23', '2014-04-30', '2014-05-07',
               '2014-05-14', '2014-05-21', '2014-05-28', '2014-06-04',
               '2014-06-11', '2014-06-18', '2014-06-25', '2014-07-02',
               '2014-07-09', '2014-07-30', '2014-08-06', '2014-08-13',
               '2014-08-20', '2014-08-27', '2014-09-03', '2014-09-10',
               '2014-11-05', '2014-11-12', '2014-11-19', '2014-11-25',
               '2015-01-07', '2015-01-14', '2015-01-21', '2015-01-28',
               '2015-02-04', '2015-02-11', '2015-03-04', '2015-03-11',
               '2015-03-18', '2015-03-25', '2015-04-01', '2015-04-08'],
              dtype='datetime64[ns]', name='Date', freq=None)

### Step 8.  frequency 를 월 단위로 변경하고(월말 기준), 각 column의 월단위로 합산값을 구하세요

In [546]:
mon = df.resample("M").sum()

### Step 9. Step8에서의 결과중 NaN으로 채워진 값이 존재하는 row를 삭제 하세요

In [549]:
mon = (mon[mon!=0].dropna())

In [550]:
mon

,Total Equity,Domestic Equity,World Equity,Hybrid,Total Bond,Taxable Bond,Municipal Bond,Total
Date,,,,,,,,
2012-12-31,-26156.0,-23126.0,-3031.0,526.0,9848.0,12613.0,-2765.0,-15782.0
2013-01-31,3661.0,-1627.0,5288.0,2730.0,12149.0,9414.0,2735.0,18540.0
2014-04-30,10842.0,1048.0,9794.0,4931.0,8493.0,7193.0,1300.0,24267.0
2014-05-31,-2203.0,-8720.0,6518.0,3172.0,13767.0,10192.0,3576.0,14736.0
2014-06-30,2319.0,-6546.0,8865.0,4588.0,9715.0,7551.0,2163.0,16621.0
2014-07-31,-7051.0,-11128.0,4078.0,2666.0,7506.0,7026.0,481.0,3122.0
2014-08-31,1943.0,-5508.0,7452.0,1885.0,1897.0,-1013.0,2910.0,5723.0
2014-09-30,-2767.0,-6596.0,3829.0,1599.0,3984.0,2479.0,1504.0,2816.0
2014-11-30,-2753.0,-7239.0,4485.0,729.0,14528.0,11566.0,2962.0,12502.0
2015-01-31,3471.0,-1164.0,4635.0,1729.0,7368.0,2762.0,4606.0,12569.0
2015-02-28,5508.0,3509.0,1999.0,1752.0,9099.0,7443.0,1656.0,16359.0
2015-03-31,5691.0,-8176.0,13867.0,2829.0,9138.0,7267.0,1870.0,17657.0
2015-04-30,379.0,-4628.0,5007.0,970.0,423.0,514.0,-91.0,1772.0

### Step 10. step 9의 결과를 이용해 연별 데이터로 변경하세요.(매년 1월 1일 기준)

In [555]:
mon.resample('AS').sum()

,Total Equity,Domestic Equity,World Equity,Hybrid,Total Bond,Taxable Bond,Municipal Bond,Total
Date,,,,,,,,
2012-01-01,-26156.0,-23126.0,-3031.0,526.0,9848.0,12613.0,-2765.0,-15782.0
2013-01-01,3661.0,-1627.0,5288.0,2730.0,12149.0,9414.0,2735.0,18540.0
2014-01-01,330.0,-44689.0,45021.0,19570.0,59890.0,44994.0,14896.0,79787.0
2015-01-01,15049.0,-10459.0,25508.0,7280.0,26028.0,17986.0,8041.0,48357.0